{
    "0": {
        "horo_name": "Овен",
        "horo_date": "21 марта — 19 апреля",
        "horoscope": "Сегодня вы можете смело говорить о своих чувствах, это не вызовет ни малейшей неловкости, если, конечно, разговаривать вы станете с самим предметом ваших воздыханий, а не с первым встречным."
    },
    "1": {
        "horo_name": "Телец",
        "horo_date": "20 апреля — 20 мая",
        "horoscope": "Помогите ближнему своему, и когда-нибудь он поможет вам. Сегодня у вас будет немного свободного времени - этим и займитесь."
    },
    "2": {
        "horo_name": "Близнецы",
        "horo_date": "21 мая — 20 июня",
        "horoscope": "Забудьте на сегодняшний день о радостях жизни. Вы можете очень продуктивно поработать, причем плоды вашего самоотверженного труда не заставят себя долго ждать. Не может быть, чтобы вы упустили подобный шанс."
    },
    "3": {
        "horo_name": "Рак",
        "horo_date": "21 июня — 22 июля",
        "horoscope": "Конечно, лучше бы договориться мирным путем, однако, если вас никак не желают слушать, придется идти напролом. Сегодня вы не можете себе позволить отступить."
    },
    "4": {
        "horo_name": "Лев",
        "horo_date": "23 июля — 22 августа",
        "horoscope": "Сегодня вам, возможно, придется объяснять тому, кто вам дорог, что он в чем-то глубоко заблуждается. Постарайтесь сохранять спокойствие - это неприятно, но не смертельно."
    },
    "5": {
        "horo_name": "Дева",
        "horo_date": "23 августа — 22 сентября",
        "horoscope": "Сегодня вам может напомнить о себе какая-то из давно забытых, но оставшихся нерешенными, проблем. При желании можете не обращать на нее слишком много внимания, решив ее вы просто очистите совесть, в вашей же жизни ничего не изменится."
    },
    "6": {
        "horo_name": "Весы",
        "horo_date": "23 сентября — 22 октября",
        "horoscope": "Сегодняшний день будет началом весьма и весьма продуктивного периода вашей жизни. Вам придется проявить твердость характера в определенных вопросах."
    },
    "7": {
        "horo_name": "Скорпион",
        "horo_date": "23 октября — 21 ноября",
        "horoscope": "Постарайтесь выражаться аккуратно. Вы легко можете нарушить то равновесие, которое вам удалось создать. Уважайте иные мнения."
    },
    "8": {
        "horo_name": "Стрелец",
        "horo_date": "22 ноября — 21 декабря",
        "horoscope": "Сегодня вы испытаете двойственные чувства. С одной стороны вас будет манить возможность расслабиться, с другой - толкать в бок чувство долга. Кто же победит?"
    },
    "9": {
        "horo_name": "Козерог",
        "horo_date": "22 декабря — 20 января",
        "horoscope": "Если сегодня кто-то потребует от вас объяснить ваше поведение, процитируйте что-нибудь подходящее, или попытайтесь отделаться шуткой. Сегодня не стоит никого посвящать ни в собственные планы, ни в их мотивировки."
    },
    "10": {
        "horo_name": "Водолей",
        "horo_date": "21 января — 18 февраля",
        "horoscope": "Сегодняшний день принесет вам массу сил и энергии, однако переизбыток оной может доставить немало неприятностей. Ища выход, она может завлечь вас не в ту сторону, в какую хотелось бы. Будьте благоразумны."
    },
    "11": {
        "horo_name": "Рыбы",
        "horo_date": "19 февраля — 20 марта",
        "horoscope": "Претворите свою мечту в жизнь. Хотя бы одну, самую завалящую. И день не пройдет даром."
    }
}