{
    "136336": {
        "joke_author": "Леонид Хлыновский",
        "joke": "Иногда, чтобы стать по-настоящему счастливым, нужно сделать шаг назад. Многие двери открываются на себя..."
    },
    "136355": {
        "joke_author": "kleon",
        "joke": "За тыщу удавлюсь. За две воскресну."
    },
    "136373": {
        "joke_author": "Леонид Хлыновский",
        "joke": "- У вас на производстве несчастные случаи были? - Секретарша бумагой порезалась. Откуда у нас производство?"
    },
    "136392": {
        "joke_author": "Ефрейтор",
        "joke": "С наступлением зимних морозов в Европе резко обострилась борьба за дрова человека."
    },
    "136335": {
        "joke_author": "Ворошек",
        "joke": "Ну вот чего говорят, что евреи умные?Арабы создали ислам - их во всём мире мусульмане поддерживают.Индусы создали буддизм - им со всего мира паломники свои денежки везут.А евреи за создание христианства ничего кроме люлей от христиан не получили."
    },
    "363939": {
        "joke_author": "нумай",
        "joke": "Миллионы лет назад приматы разделились на обезьян и людей. Одни смогли эволюционировать, и живут достойно в комфортной среде обитания. Другие пока продолжают ходить на работу."
    },
    "363555": {
        "joke_author": "вася5",
        "joke": "Европеец спросил на канадском форуме, почему так мало канадцев интересуются футболом. Ответ:Мы бы с удовольствием смотрели, но с несколькими изменениями правил:- Поле слишком большое, а активность лишь на небольшом участке. Надо уменьшить.- Игроков слишком много, опять-же активны лишь небольшое число за раз. Ограничиться тремя форвардами, двумя защитниками, и вратарем.- Слишком много пауз. Дать право игрокам менять состав команд на поле без ограничений. - Опять-же, слишком много пауз. Уменьшить количество наказуемых нарушений, и как следствие, прекращение игры. Симулянты должны встречаться свистом, а не желтыми карточками.- Голы слишком легко забиваются один-на-один с вратарем. Уменьшить ворота.- Залить льдом."
    },
    "363554": {
        "joke_author": "asto03",
        "joke": "Менеджер банка читает анкету потенциального заёмщика в его присутствии:- Вижу что в графе \"Образование\" вы указали \"Сельхозакадемия\",  а графе \"Род занятий\" - фермер. В наше время нечасто встретишь счастливчика, работающего по специальности, полученной в ВУЗе. Позвольте поинтересоваться, а какую продукцию производит ваша ферма?- Криптовалюту."
    },
    "136393": {
        "joke_author": "Леонид Хлыновский",
        "joke": "- Я одна на миллион!- Значит, таких, как ты, около 8 тысяч."
    },
    "136318": {
        "joke_author": "Леонид Хлыновский",
        "joke": "Девушка из Нью-Йорка, проводившая каникулы в деревне, пожаловалась фермеру на быка, который очень свирепо  разглядывал её. - Должно быть, это из-за вашей красной блузки, - сказал фермер. - Боже мой! - воскликнула девушка. - Я, конечно, знаю, что она у меня старомодная, но мне и в голову не пришло, что это может заметить деревенский бык!"
    },
    "136374": {
        "joke_author": "Леонид Хлыновский",
        "joke": "Прежде чем думать, подумайте как следует."
    },
    "363739": {
        "joke_author": "glazun",
        "joke": "Проктолог разъясняет теорию относительности.- Всё в мире относительно. У одних от геморроя боли и кровотечения. А у меня квартира, дача и Мерседес."
    },
    "136412": {
        "joke_author": "Леонид Хлыновский",
        "joke": "Судя по длине курток девушек, этой зимой в моде будет цистит."
    },
    "363557": {
        "joke_author": "Василий Лукашик",
        "joke": "Девушку, которая встречается с семью парнями одновременно, бабушки во дворе ласково называют Белоснежка."
    },
    "363352": {
        "joke_author": "darth955",
        "joke": "Муж, он как мяч - сильно пнёшь, улетит в чужие ворота."
    },
    "136375": {
        "joke_author": "vitneo",
        "joke": "- Я что-то нарушил?- Безусловно… и сейчас вы расскажете что именно."
    },
    "364125": {
        "joke_author": "afanasyj",
        "joke": "Только что осенило. Ипполит в «Иронии» принимает душ в пальто — не случайность (как утверждает режиссёр). Ипполит — от греческого «иппос» — конь. То есть, Ипполит под душем — тот самый конь в пальто."
    },
    "363353": {
        "joke_author": "Ну вы блин даете",
        "joke": "- Кем бы ты хотел не работать, когда вырастешь?- За высокую зарплату я готов не работать кем угодно. Лучше всего депутатом. Как ты, папа..."
    },
    "364131": {
        "joke_author": "Табуреткин",
        "joke": "Моя девушка переоделась в копа и сказала мне, что я арестован за подозрение в навыке слишком хорошего секса... Через две минуты дело было закрыто из-за недостатка доказательств."
    },
    "363370": {
        "joke_author": "птица",
        "joke": "Анечка пришла на утренник в костюме Мэрилина Мэнсона, потому что никакая снежинка не сможет передать всю глубину ее стишка про тлен и безысходность."
    },
    "136394": {
        "joke_author": "immar",
        "joke": "Почему существует множество анонимных обществ алкоголиков, курильщиков, клептоманов, а обществ анонимных идиотов не существует?Организовал такое общество, дал обявления во всех СМИ. Вторую неделю сижу один как дурак, жду клиентов, но так никто и не пришел."
    },
    "363558": {
        "joke_author": "Дракула Задунайский",
        "joke": "Хорошее здоровье - это просто очень медленный способ умирать."
    },
    "363735": {
        "joke_author": "Хлын Леонидов",
        "joke": "Если буду устраиваться на работу, пойду дворником. За своим наблюдаю и ахреневаю. Выйдет на работу, откроет каморку, достанет метлу. Прислонит её к дереву, закурит сигаретку. Посидит на лавочке, покурит, поздоровается с 200-ми человек. Выбросит окурок в урну соседнего двора, запрёт метлу на место и уйдёт. В общем, работа - самая для меня."
    },
    "136356": {
        "joke_author": "шурикЯ",
        "joke": "По мнению всех её знающих, лучшим экспертом-прогнозистом цен на продукты является тётя Фира, которая на вопрос: \"Какие продукты подорожают к Новому Году?\" уже лет так тридцать не ошибается! Её прогноз и на этот год остался неизменным: Таки, фактически, все!"
    },
    "363349": {
        "joke_author": "balda",
        "joke": "Группе \"Звери\" в этом году 22 года. В пересчете на человеческий это примерно 80 лет."
    },
    "136395": {
        "joke_author": "Леонид Хлыновский",
        "joke": "Денег нет настолько, что пришлось заменить утренний кофе утренней зарядкой."
    },
    "363947": {
        "joke_author": "vitneo",
        "joke": "Какие там оптимисты, пессимисты и реалисты…  В этом мире похоже сейчас можно прожить только пох@истом…"
    },
    "363737": {
        "joke_author": "balda",
        "joke": "— Чихнул — значит правда.— Господин судья, защита протестует!— С чихом не поспоришь."
    },
    "363178": {
        "joke_author": "Cat Fil",
        "joke": "Говорят, что в Иваново мужики на вес золота. Как можно обменять 110 килограмм своего мужика хотя бы на серебро?"
    },
    "364123": {
        "joke_author": "Татусик",
        "joke": "\"Людей не выбирают,\" - грустно шутят между собой собаки."
    },
    "363174": {
        "joke_author": "Филимон Пупер",
        "joke": "- Как жизнь?- Ужасно. Иду через ад.- Главное, не останавливайся!"
    },
    "363738": {
        "joke_author": "Неблок",
        "joke": "Современного осла заставляют гоняться за виртуальной морковкой."
    },
    "364132": {
        "joke_author": "шурикЯ",
        "joke": "\"Дорогих\" женщин, как и дорогие тачки, чаще всего берут мужчины, для которых их замена - норма. Просто потому, что \"модель\" чуть устарела, надоела, или просто потеряла первоначальный лоск..."
    },
    "363361": {
        "joke_author": "vitneo",
        "joke": "Лучше быть без ума от женщин чем без женщин от ума"
    },
    "363183": {
        "joke_author": "Сафронов Николай",
        "joke": "Тут уж как кому повезёт. Иному достаточно просто приделать к полену нос, чтобы войти в сокровищницу мировой литературы."
    },
    "363184": {
        "joke_author": "Алекс Грачев",
        "joke": "- После вчерашнего прямо голова раскалывается.- А что было вчера?- Не помню."
    },
    "363560": {
        "joke_author": "opologov",
        "joke": "В продажу поступили халаты на любой вкус: для служебной, домашней и супружеской халатностей."
    },
    "363930": {
        "joke_author": "Сафронов Николай",
        "joke": "- Плесни мне винишка в стакан.- Но тебе нельзя, ты же болеешь.- Да мне только лекарство запить."
    },
    "363358": {
        "joke_author": "Criptor",
        "joke": "Ценник:\"Спортивный костюм пижамного стиля\""
    },
    "364126": {
        "joke_author": "vitneo",
        "joke": "Среди электриков нет дилетантов… среди живых электриков"
    },
    "364128": {
        "joke_author": "Gleb Smith",
        "joke": "Очередь в женский туалет, мимо пытается пролезть толстая бабища со словами:— Пропустите, граждане, мне только спросить!"
    },
    "363742": {
        "joke_author": "Алекс Грачев",
        "joke": "- На работе Рабинович постоянно поднимает руку на женщин. - А кем он работает?- Дирижером симфонического оркестра."
    },
    "363506": {
        "joke_author": "orntag",
        "joke": "-Вы убили человека...-Ваша честь, он всё равно бы спился или погиб в аварии. Знаете сколько гибнет в ДТП ежегодно? 30 тыс!!!-Не виновен!"
    },
    "363469": {
        "joke_author": "Ёпта",
        "joke": "Даже если сборная России разделится на две команды и они сыграют друг с другом - обе проиграют."
    },
    "363945": {
        "joke_author": "ГыкС",
        "joke": "Однажды вечером Анжела попала в пробку. А планировала, чтобы наоборот."
    },
    "364130": {
        "joke_author": "vitneo",
        "joke": "Молчание женщины должно настораживать… долгое молчание – пугать"
    },
    "363941": {
        "joke_author": "Corpcollection",
        "joke": "Очень пьяный муж возвращается домой после нескольких дней отсутствия и быстро садится есть, чтобы жена не заметила его состояние. Муж ест и нахваливает: Дорогая, какая хорошая и свежая у тебя уха! Рыбки как будто еще плавают!Жена: Ах, ты пьяный гад! Вынь ложку из аквариума!"
    },
    "363181": {
        "joke_author": "Татусик",
        "joke": "Все-таки люди с возрастом становятся терпимее. Знавал я одного брюзгу, который всю жизнь говорил всем только гадости. А в один день как отрезало. Правда, перед этим он умер..."
    },
    "364133": {
        "joke_author": "Василий Лукашик",
        "joke": "На вопрос «Как смотреть на жизнь философски?» армянское радио ответило:«Попробуйте - через гранёный стакан»."
    },
    "363368": {
        "joke_author": "ihniht",
        "joke": "Не понимаю, почему во время секса со мной все девушки орут \"Полиция!!!\" Никогда в жизни там не работал..."
    }
}